tutorials/icoLagrangianFoam/channelParticles/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/hjasak/OpenFOAM/OpenFOAM-1.3/tutorials/icoLagrangianFoam";
    case "channelParticles";
    instance ""constant"";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
topAndBottom
{
    type wall;
    nFaces 200;
    startFace 1890;
}

in
{
    type patch;
    nFaces 10;
    startFace 2090;
}

out
{
    type patch;
    nFaces 10;
    startFace 2100;
}

frontAndBack
{
    type empty;
    physicalType empty;
    nFaces 2000;
    startFace 2110;
}
)

// ************************************************************************* //
